driver-tests/bpelse/assign/AssignJbi/test/echoNCNameDataType_Invoke/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns="http://stc.com/echoNCNameDataType">
<SOAP-ENV:Header/>
<SOAP-ENV:Body>
  <item xmlns="http://stc.com/echoNCNameDataType">
    <string>NCName</string>
    <normalizedString>NCName</normalizedString>
    <token>NCName</token>
    <base64Binary>NCName</base64Binary>
    <hexBinary>NCName</hexBinary>
    <integer>NCName</integer>
    <positiveInteger>NCName</positiveInteger>
    <negativeInteger>NCName</negativeInteger>
    <nonNegativeInteger>NCName</nonNegativeInteger>
    <nonPositiveInteger>NCName</nonPositiveInteger>
    <long>NCName</long>
    <unsignedLong>NCName</unsignedLong>
    <int>NCName</int>
    <unsignedInt>NCName</unsignedInt>
    <short>NCName</short>
    <unsignedShort>NCName</unsignedShort>
    <byte>NCName</byte>
    <unsignedByte>NCName</unsignedByte>
    <decimal>NCName</decimal>
    <float>NCName</float>
    <double>NCName</double>
    <boolean>NCName</boolean>
    <duration>NCName</duration>
    <dateTime>NCName</dateTime>
    <date>NCName</date>
    <time>NCName</time>
    <gYear>NCName</gYear>
    <gYearMonth>NCName</gYearMonth>
    <gMonth>NCName</gMonth>
    <gMonthDay>NCName</gMonthDay>
    <gDay>NCName</gDay>
    <Name>NCName</Name>
    <QName>NCName</QName>
    <NCName>NCName</NCName>
    <anyURI>NCName</anyURI>
    <language>NCName</language>
    <ID>NCName</ID>
    <IDREF>NCName</IDREF>
    <IDREFS>NCName</IDREFS>
    <ENTITY>NCName</ENTITY>
    <ENTITIES>NCName</ENTITIES>
    <NMTOKEN>NCName</NMTOKEN>
    <NMTOKENS>NCName</NMTOKENS>
  </item>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
